//
//  01shift.c
//  C_learning
//
//  Created by 王育玲 on 2023/5/8.
//

/*
 一.练习
 键盘输入一个[-128, 127]的整数, 以二进制的方式打印输出
 int a = 85;
 scanf();
 打印输出二进制 : 01010101

 */

/*
按位与  & ：
    任何数据和1做按位与, 结果不变
    任何数据和0做按位与, 结果为0
按位或 | ：
    任何数据和1做按位或, 结果为1
    任何数据和0做按位或, 结果保持不变
 */
#if 0

#include <stdio.h>

int main(void){
    printf("请输入一个整数[-128:127]:");
    char c;
    scanf("%hhd", &c);//85 = 0101 0101
    printf("转换为二进制:");
    unsigned int mask = 128;//1000 0000

    //c:    xxxx xxxx
    //mask: 1000 0000
    //&---------------
    //      x000 0000
    //c[7]=0, & = 0; c[7]=1,& != 0;
    //c&mask ==0, '0'
    //c&mask !=0, '1'
    
    //c:    0101 0101
    //mask: 1000 0000
    //&---------------
    //      0000 0000
    //[7]=0, 0; [7]=1,非0;
    printf("%c", c & mask ? '1' : '0');
    mask = mask>>1;//mask = 1000 0000 >> 1 = 0100 0000

    //c:    0101 0101
    //mask: 0100 0000
    //&---------------
    //      0100 0000
    //[6]=0, 0; [6]=1,非0;
    printf("%c", c & mask ? '1' : '0');
    mask = mask>>1;//mask = 0100 0000 >>1 = 0010 0000

    //c:    0101 0101
    //mask: 0010 0000
    //&---------------
    //      0000 0000
    //[5]=0, 0; [5]=1,非0;
    printf("%c", c & mask ? '1' : '0');
    mask = mask>>1;//mask = 0010 0000 >> 1 = 0001 0000

    //c:    0101 0101
    //mask: 0001 0000
    //&---------------
    //      0001 0000
    printf("%c", c & mask ? '1' : '0');
    mask = mask>>1;//mask = 0001 0000>>1 = 0000 1000


    //c:    0101 0101
    //mask: 0000 1000
    //&---------------
    //      0000 0000
    printf("%c", c & mask ? '1' : '0');
    mask = mask>>1;//mask = 0000 1000 >> 1 = 0000 0100

    //c:    0101 0101
    //mask: 0010 0100
    //&---------------
    //      0000 0100
    printf("%c", c & mask ? '1' : '0');
    mask = mask>>1;//mask = 0000 0100 >> 1 = 0000 0010
    //c:    0101 0101
    //mask: 0000 0010
    //&---------------
    //      0000 0000
    printf("%c", c & mask ? '1' : '0');
    mask = mask>>1;//mask = 0000 0010 >> 1 = 0000 0001

    //c:    0101 0101
    //mask: 0000 0001
    //&---------------
    //      0000 0001
    printf("%c", c & mask ? '1' : '0');
    printf("\n");
    return 0;
}

#endif

