//
//  01exec.c
//  C_learning
//
//  Created by 王育玲 on 2023/5/8.
//
/*
课下练习 :
1. int a = 10, b = 9, c;
c = (--a == b++) ? --a : b++;
    a = ?
    b = ?
    c = ?
2. int a = 10;
    printf("%d\n", a++ + ++a + ++a);
    printf("a = %d\n", a);
*/

#if 0

#include <stdio.h>

int main(void){
    int a = 10, b = 9, c = 0;
    //--a :先减后用 b++ : 先用后加
    //(--a == b++) (9 == 9) -> 条件成立 -> 使用--a作为运算结果
    //--a -> 9->8 ->结果a=8
    //c = --a; c == 8
    //
    //b++ -> 变为10 b == 10
    c = (--a == b++) ? --a : b++;
    printf("--------------\n\n");
    printf("a = %d, b = %d, c = %d.\n\n", a, b, c);
    printf("--------------\n\n");

    a = 10;
    printf("a = %d\n", a);
    //有三个数据, 运算的时候, 记住了, 一个一个来
    //a++先用后加
    //5 + 6 + 7 -> 先算5+6的值, 再算11+7的值
    //先算a++ + ++a, 使用加和的结果 + ++a
    //a = 10;
    //a++ + ++a -> 11 + 11 -> 22
    //a++ + ++a后, 是否可以认为这两个数字的计算, 算完了 -> 可以这么认为
    //a->12 ++a -> 13
    //22 + ++a == 22 + 13 = 35
    printf("a++ + ++a + ++a = %d\n", a++ + ++a + ++a);
    printf("a = %d\n\n", a);
    printf("--------------\n");

    b = 100;
    //c = (++b)++;
    //printf("c = %d\n", c);
    //

    a = 10;
    printf("%d\n", ++a + a++);
    printf("%d\n", a++ + ++a);
    return 0;
}

#endif






